{
  "html": {
    "content": {
      "icon" : "",
      "header": "HTML5",
      "text": "I have a very solid foundation knowledge of html and feel very comfortable using it."
    }
  },
  "css": {
    "content": {
      "icon" : "",
      "header": "CSS header",
      "text": "I am very comfortable using CSS, and understand how to create keyframe animations, transitions, and what is needed to create responsively designed web apps."
    }
  },
  "bootstrap": {
    "content": {
      "icon" : "",
      "header": "Bootstrap header",
      "text": "I use bootstrap in almost all my projects, usually with through the npm reactstrap package."
    }
  },
  "linux": {
    "content": {
      "icon" : "",
      "header": "Linux",
      "text": "I have a basic understanding of UNIX systems, to the extent that I have Ubuntu installed on my laptop and create apps in Digital Ocean \"Droplets\", which are virtual linux kernel machines."
    }
  },
  "mongodb": {
    "content": {
      "icon" : "",
      "header": "MongoDB ",
      "text": "I have used MongoDB in several projects, and prefer it to more traditional database systems like SQL."
    }
  },
  "php": {
    "content": {
      "icon" : "",
      "header": "PHP header",
      "text": "I worked with PHP when completing a WordPress project for a client last year. "
    }
  },
  "git": {
    "content": {
      "icon" : "",
      "header": "Github / Git Bash",
      "text": "I use Git for all my major projects. I understand how the Git repository structure works and am very comfortable working with Git from the command line."
    }
  },
  "node.js": {
    "content": {
      "icon" : "",
      "header": "Node.js",
      "text": "I am still working to understand the ins and outs of Node but I have a working knowledge and have used it in several projects. The most extensive use I have made of it involves handling server calls and calling Python child processes to handle database manipulation as well as spreadsheet and email generation in my GCC Inventory Management App, which you can find listed in the portfolio of my website."
    }
  },
  "powershell": {
    "content": {
      "icon" : "",
      "header": "Powershell",
      "text": "I have a solid working knowledge of Powershell. While I haven't tried to get too fancy with it, I do use it as my primary CLI."
    }
  },
  "json": {
    "content": {
      "icon" : "",
      "header": "JSON header",
      "text": "After my last several projects, I can finally say I am very comfortable with using JSON and its structure. I really appreciate how much it simplifies passing state and props in my React Components and feel like I \"leveled up\" as a programmer once it clicked."
    }
  },
  "express.js": {
    "content": {
      "icon" : "",
      "header": "Skill header",
      "text": "I have a solid working knowledge of Express; I understand the concept of middleware and have implemented Express servers in several of my applications. My most extensive use of Express is in my GCC Inventory Management App, which required me to configure both Express and a NginX reverse proxy server to work together."
    }
  },
  "nginx": {
    "content": {
      "icon" : "",
      "header": "NginX",
      "text": "I have only worked with NginX on one project, but I was able to successfully implement a NginX reverse proxy server on a Digital Ocean Droplet (a virtual Linux kernel) to work with the GCC Inventory Management app I had created."
    }
  },
  "brand management": {
    "content": {
      "icon" : "",
      "header": "Brand Management ",
      "text": "I graduated from NC State with a degree in Brand Management and Marketing. This was an academic course focused on new product development and entrepreneurship, and many of the principles taught in my visual marketing and design course directly translate to front end design."
    }
  },
  "front end development": {
    "content": {
      "icon" : "",
      "header": "Front End Development header",
      "text": "I have a very solid undestanding of both HTML and CSS, and would consider my knowledge intermediate. I know how to create responsively designed web applications, have a working knowledge of SVGs, understand and use transitions and keyframes, and look for opportunities to try more advanced CSS animations."
    }
  },
  "back end development": {
    "content": {
      "icon" : "",
      "header": "Back End Development header",
      "text": "I am knowledgeable enough in back end development to create a full stack application from scratch. The most technically advanced back end work I have completed to this date is present in my GCC Inventory Management app, which is listed in the Portfolio section of this website."
    }
  },
  "jQuery": {
    "content": {
      "icon" : "",
      "header": "jQuery header",
      "text": "Given that I work mainly with React when designing the front end of my web applications, jQuery tends to be unnecessary in many of my apps. However, I have used it in early past projects and used it extensively in a WordPress website I created for a client last year."
    }
  },
  "responsive design": {
    "content": {
      "icon" : "",
      "header": "Responsive design header",
      "text": "Responsive design Text"
    }
  },
  "marketing": {
    "content": {
      "icon" : "",
      "header": "Marketing header",
      "text": "Marketing Text"
    }
  },
  "java": {
    "content": {
      "icon" : "",
      "header": "java header",
      "text": "java Text"
    }
  },
  "webpack": {
    "content": {
      "icon" : "",
      "header": "Webpack header",
      "text": "Webpack Text"
    }
  },
  "wordpress": {
    "content": {
      "icon" : "",
      "header": "wordpress header",
      "text": "wordpress Text"
    }
  },
  "object oriented programming": {
    "content": {
      "icon" : "",
      "header": "object oriented programming header",
      "text": "object oriented programming Text"
    }
  },
  "react router": {
    "content": {
      "icon" : "",
      "header": "react router header",
      "text": "react router Text"
    }
  },
  "d3": {
    "content": {
      "icon" : "",
      "header": "d3 header",
      "text": "d3 Text"
    }
  },
  "relational databases": {
    "content": {
      "icon" : "",
      "header": "relational databases header",
      "text": "relational databases Text"
    }
  },
  "python": {
    "content": {
      "icon" : "",
      "header": "python header",
      "text": "python Text"
    }
  },
  "javaScript": {
    "content": {
      "icon" : "",
      "header": "javascript header",
      "text": "javascript Text"
    }
  },
  "react.js": {
    "content": {
      "icon" : "",
      "header": "React.js header",
      "text": "React.js Text"
    }
  }
}
